app/Controllers/Restaurant/Dashboard.php

SELECT *
FROM `users`
WHERE `tenant_id` = 'jollibee'
AND `is_active` = 1
---
    public function index()
    {
        // Get employee statistics
        $totalEmployees = 0;
        $activeEmployees = 0;
        $employeesByRole = [];

        try {
            // Get employees from main database for this tenant
            $db = \Config\Database::connect('default');
            $employees = $db->table('users')
                           ->where('tenant_id', $this->tenantId)
                           ->where('is_active', 1)
                           ->get()
                           ->getResult();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE(ordered_at) = '2026-01-30'
AND `status` NOT IN ('created','cancelled')
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'pending'
AND DATE(ordered_at) = '2026-01-30'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'preparing'
AND DATE(ordered_at) = '2026-01-30'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'completed'
AND `payment_status` = 'paid'
AND DATE(ordered_at) = '2026-01-30'
SELECT COUNT(*) AS `numrows`
FROM `restaurant_tables`
WHERE `tenant_id` = 'jollibee'
AND `status` IN ('available','occupied','reserved','cleaning')
AND `is_active` = 1
SELECT SUM(total_amount) as total_revenue
FROM `orders`
WHERE `payment_status` = 'paid'
AND DATE(ordered_at) = '2026-01-30'
---
            // Get order statistics
            $today = date('Y-m-d');
            // Orders today excluding created and cancelled
            $orderStats['orders_today'] = $this->tenantDb->table('orders')
                                                ->where('DATE(ordered_at)', $today)
                                                ->whereNotIn('status', ['created', 'cancelled'])
                                                ->countAllResults();
            // Pending Orders
            $orderStats['pending_orders'] = $this->tenantDb->table('orders')
                                                         ->where('status', 'pending')
                                                         ->where('DATE(ordered_at)', $today)
                                                         ->countAllResults();
            // Preparing Orders
            $orderStats['preparing_orders'] = $this->tenantDb->table('orders')
                                                           ->where('status', 'preparing')
                                                           ->where('DATE(ordered_at)', $today)
                                                           ->countAllResults();
            // Completed Orders - served + paid
            $orderStats['completed_orders'] = $this->tenantDb->table('orders')
                                                           ->where('status', 'completed')
                                                           ->where('payment_status', 'paid') // if needed along with completed status
                                                           ->where('DATE(ordered_at)', $today)
                                                           ->countAllResults();

            // Get active tables available, but not including unavailable
            $active_tables = $this->tenantDb->table('restaurant_tables')
                    ->where('tenant_id', $this->tenantId)
                    ->whereIn('status', ['available','occupied','reserved','cleaning'])
                    ->where('is_active', 1)
                    ->countAllResults();

            // Get today's revenue
            $revenueResult = $this->tenantDb->table('orders')
                                          ->select('SUM(total_amount) as total_revenue')
                                          ->where('payment_status', 'paid')
                                          ->where('DATE(ordered_at)', $today)
                                          ->get()
                                          ->getRow();

SELECT `o`.*, `rt`.`table_number`, COUNT(oi.id) as item_count
FROM `orders` as `o`
LEFT JOIN `restaurant_tables` `rt` ON `o`.`table_id` = `rt`.`id`
LEFT JOIN `order_items` `oi` ON `o`.`id` = `oi`.`order_id`
GROUP BY `o`.`id`
ORDER BY `o`.`created_at` DESC
 LIMIT 10
SELECT *
FROM `staff`
WHERE `tenant_id` = 'jollibee'
ORDER BY `role`, `first_name`
---
            $orderStats['today_revenue'] = $revenueResult->total_revenue ?? 0;

            // Get recent orders with table information
            $recentOrders = $this->tenantDb->table('orders as o')
                                         ->select('o.*, rt.table_number, COUNT(oi.id) as item_count')
                                         ->join('restaurant_tables rt', 'o.table_id = rt.id', 'left')
                                         ->join('order_items oi', 'o.id = oi.order_id', 'left')
                                         ->groupBy('o.id')
                                         ->orderBy('o.created_at', 'DESC')
                                         ->limit(10)
                                         ->get()
                                         ->getResult();

            // Get Employees stats
            $staffMembers = $this->tenantDb->table('staff')
                         ->where('tenant_id', $this->tenantId)
                         ->orderBy('role, first_name')
                         ->get()
                         ->getResult();

SELECT *
FROM `menu_categories`
WHERE `is_active` = 1
ORDER BY `display_order`
SELECT `mi`.*, `mc`.`name` as `category_name`
FROM `menu_items` `mi`
JOIN `menu_categories` `mc` ON `mi`.`category_id` = `mc`.`id`
WHERE `mi`.`is_available` = 1
ORDER BY `mc`.`display_order`, `mi`.`display_order`
SELECT *
FROM `restaurant_tables`
WHERE `status` = 'available'
ORDER BY `table_number` ASC
---
    public function pos()
    {
        // Get menu categories from database
        $menuCategories = $this->tenantDb->table('menu_categories')
                                        ->where('is_active', 1)
                                        ->orderBy('display_order')
                                        ->get()
                                        ->getResult();

        // Get menu items from database
        $menuItems = $this->tenantDb->table('menu_items mi')
                                   ->select('mi.*, mc.name as category_name')
                                   ->join('menu_categories mc', 'mi.category_id = mc.id')
                                   ->where('mi.is_available', 1)
                                   ->orderBy('mc.display_order, mi.display_order')
                                   ->get()
                                   ->getResult();

        // Get available tables
        $tables = $this->tenantDb->table('restaurant_tables')
                                ->where('status', 'available')
                                ->orderBy('table_number', 'ASC')
                                ->get()
                                ->getResult();

SELECT *
FROM `inventory_items`
WHERE `tenant_id` = 'jollibee'
AND `is_active` = 1
ORDER BY `category`, `item_name`
---
    public function inventory()
    {
        // Get inventory items from database
        $inventoryItems = [];
        $summaryStats = [
            'total_items' => 0,
            'in_stock' => 0,
            'low_stock' => 0,
            'out_of_stock' => 0
        ];

        try {
            $inventoryItems = $this->tenantDb->table('inventory_items')
                                           ->where('tenant_id', $this->tenantId)
                                           ->where('is_active', 1)
                                           ->orderBy('category, item_name')
                                           ->get()
                                           ->getResult();

SELECT `o`.*, `rt`.`table_number`, COUNT(oi.id) as item_count
FROM `orders` as `o`
LEFT JOIN `restaurant_tables` `rt` ON `o`.`table_id` = `rt`.`id`
LEFT JOIN `order_items` `oi` ON `o`.`id` = `oi`.`order_id`
WHERE `o`.`payment_status` != 'paid'
AND `o`.`status` != 'completed'
AND `o`.`status` != 'cancelled'
GROUP BY `o`.`id`
ORDER BY `o`.`created_at` DESC
SELECT `oi`.*, `mi`.`name` as `menu_item_name`
FROM `order_items` as `oi`
LEFT JOIN `menu_items` `mi` ON `oi`.`menu_item_id` = `mi`.`id`
WHERE `oi`.`order_id` = '659'
---
    public function currentOrders()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['error' => 'Invalid request method'])->setStatusCode(400);
        }

        try {
            // 통합 주문 시스템 사용
            $orderModel = new \App\Models\Tenant\OrderModel();
            // Set the database connection for the model
            $orderModel->setDB($this->tenantDb);

            // 활성 주문만 필터링 (완료되지 않은 주문)
            // Get ACTIVE orders only (not paid, not completed)
            $orders = $this->tenantDb->table('orders as o')
                                ->select('o.*, rt.table_number, COUNT(oi.id) as item_count')
                                ->join('restaurant_tables rt', 'o.table_id = rt.id', 'left')
                                ->join('order_items oi', 'o.id = oi.order_id', 'left')
                                ->where('o.payment_status !=', 'paid')  // Exclude paid orders
                                ->where('o.status !=', 'completed')     // Exclude completed orders
                                ->where('o.status !=', 'cancelled')     // Exclude cancelled orders
                                ->groupBy('o.id')
                                ->orderBy('o.created_at', 'DESC')
                                ->get()
                                ->getResult();

            // Add guest count and items for each order
            foreach ($orders as $order) {
                $order->guest_count = $order->guest_count ?? null;
                $order->items = $this->tenantDb->table('order_items as oi')
                                            ->select('oi.*, mi.name as menu_item_name')
                                            ->join('menu_items mi', 'oi.menu_item_id = mi.id', 'left')
                                            ->where('oi.order_id', $order->id)
                                            ->get()
                                            ->getResult();

SELECT *
FROM `menu_categories`
WHERE `tenant_id` = 'jollibee'
AND `is_active` = 1
ORDER BY `display_order`
SELECT `mi`.*, `mc`.`name` as `category_name`
FROM `menu_items` `mi`
JOIN `menu_categories` as `mc` ON `mi`.`category_id` = `mc`.`id`
WHERE `mi`.`tenant_id` = 'jollibee'
AND `mi`.`is_available` = 1
ORDER BY `mc`.`display_order`, `mi`.`display_order`
---
    public function menu()
    {
        // Simple approach - get data directly
        $menuCategories = [];
        $menuItems = [];

        try {
            // Get menu categories
            $menuCategories = $this->tenantDb->table('menu_categories')
                                            ->where('tenant_id', $this->tenantId)
                                            ->where('is_active', 1)
                                            ->orderBy('display_order')
                                            ->get()
                                            ->getResult();

            // Get menu items
            $menuItems = $this->tenantDb->table('menu_items mi')
                                       ->select('mi.*, mc.name as category_name')
                                       ->join('menu_categories as mc', 'mi.category_id = mc.id')
                                       ->where('mi.tenant_id', $this->tenantId)
                                       ->where('mi.is_available', 1)
                                       ->orderBy('mc.display_order, mi.display_order')
                                       ->get()
                                       ->getResult();