app/Controllers/Restaurant/Dashboard.php

    public function pos()
    {
        // Get menu categories from database
        $menuCategories = $this->tenantDb->table('menu_categories')
                                        ->where('is_active', 1)
                                        ->orderBy('display_order')
                                        ->get()
                                        ->getResult();

        // Get menu items from database
        $menuItems = $this->tenantDb->table('menu_items mi')
                                   ->select('mi.*, mc.name as category_name')
                                   ->join('menu_categories mc', 'mi.category_id = mc.id')
                                   ->where('mi.is_available', 1)
                                   ->orderBy('mc.display_order, mi.display_order')
                                   ->get()
                                   ->getResult();

        // Get available tables
        $tables = $this->tenantDb->table('restaurant_tables')
                                ->where('status', 'available')
                                ->orderBy('table_number')
                                ->get()
                                ->getResult();
---
SELECT *
FROM `menu_categories`
WHERE `is_active` = 1
ORDER BY `display_order`
SELECT `mi`.*, `mc`.`name` as `category_name`
FROM `menu_items` `mi`
JOIN `menu_categories` `mc` ON `mi`.`category_id` = `mc`.`id`
WHERE `mi`.`is_available` = 1
ORDER BY `mc`.`display_order`, `mi`.`display_order`
SELECT *
FROM `restaurant_tables`
WHERE `status` = 'available'
ORDER BY `table_number` ASC