app/Controllers/Restaurant/Pos.php

SELECT `o`.*, `rt`.`table_number`
FROM `orders` `o`
LEFT JOIN `restaurant_tables` `rt` ON `o`.`table_id` = `rt`.`id`
WHERE `o`.`payment_status` = 'paid'
ORDER BY `o`.`completed_at` DESC
SELECT `oi`.*, COALESCE(mi.name, oi.item_name) as menu_item_name
FROM `order_items` `oi`
LEFT JOIN `menu_items` `mi` ON `oi`.`menu_item_id` = `mi`.`id`
WHERE `oi`.`order_id` = '644'
---
    public function paidOrders()
    {
        $this->requireRole(['manager', 'cashier', 'waiter']);

        if (!$this->request->isAJAX()) {
            return $this->jsonResponse(['error' => 'Invalid request method'], 400);
        }

        try {
            $orders = $this->tenantDb->table('orders o')
                ->select('o.*, rt.table_number')
                ->join('restaurant_tables rt', 'o.table_id = rt.id', 'left')
                ->where('o.payment_status', 'paid')
                ->orderBy('o.completed_at', 'DESC')
                ->get()
                ->getResult();

            foreach ($orders as $order) {
                $order->items = $this->tenantDb->table('order_items oi')
                    ->select('oi.*, COALESCE(mi.name, oi.item_name) as menu_item_name')
                    ->join('menu_items mi', 'oi.menu_item_id = mi.id', 'left')
                    ->where('oi.order_id', $order->id)
                    ->get()
                    ->getResult();