app/Models/Tenant/OrderModel.php

    public function getOrderWithItems($orderId)
    {
        // 주문 기본 정보
        $order = $this->select('
            o.*,
            GROUP_CONCAT(DISTINCT rt.table_number ORDER BY rt.table_number) as table_numbers,
            CONCAT(s.first_name, " ", s.last_name) as waiter_name,
            CONCAT(c.first_name, " ", c.last_name) as cashier_name
        ')
        ->from('orders o')
        ->join('order_tables ot', 'o.id = ot.order_id', 'left')
        ->join('restaurant_tables rt', 'ot.table_id = rt.id', 'left')
        ->join('staff s', 'o.waiter_id = s.id', 'left')
        ->join('staff c', 'o.cashier_id = c.id', 'left')
        ->where('o.id', $orderId)
        ->groupBy('o.id')
        ->get()
        ->getRow();

        if (!$order) {
            return null;
        }

        // 주문 아이템 정보
        $orderItems = $this->db->table('order_items oi')
            ->select('oi.*, mi.name as menu_item_name, mi.description')
            ->join('menu_items mi', 'oi.menu_item_id = mi.id', 'left')
            ->where('oi.order_id', $orderId)
            ->get()
            ->getResult();
---
SELECT `oi`.*, `mi`.`name` as `menu_item_name`, `mi`.`description`
FROM `order_items` `oi`
LEFT JOIN `menu_items` `mi` ON `oi`.`menu_item_id` = `mi`.`id`
WHERE `oi`.`order_id` = '662'