app/Filters/TenantFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $uri = $request->getUri();
        $segments = $uri->getSegments();

        // Extract tenant slug from URL
        // URL pattern: /restaurant/{tenant_slug}/...
        if (isset($segments[0]) && $segments[0] === 'restaurant' && isset($segments[1])) {
            $tenantSlug = $segments[1];

            // Load tenant from database
            $tenantModel = new TenantModel();
            $tenant = $tenantModel->where('tenant_slug', $tenantSlug)
                                  ->where('status', 'active')
                                  ->first();
---
SELECT *
FROM `tenants`
WHERE `tenant_slug` = 'jollibee'
AND `status` = 'active'
 LIMIT 1