app/Controllers/BaseRestaurantController.php

    protected function validateTenant(): bool
    {
        try {
            $masterDb = \Config\Database::connect('default');
            $query = $masterDb->table('tenants')
                             ->where('tenant_slug', $this->tenantId)
                             ->where('status', 'active')
                             ->get();
---
SELECT *
FROM `tenants`
WHERE `tenant_slug` = 'jollibee'
AND `status` = 'active'

    protected function loadTenantConfiguration(): void
    {
        try {
            // Get settings from tenant database
            $settings = $this->tenantDb->table('settings')->get()->getResult();
---
SELECT *
FROM `settings`